CSI API ETABS v1
eLength Enumeration
 The length units that can be specified for the model.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eLength
Public Enumeration eLength
Dim instance As eLength
public enum class eLength
type eLength
Members
Member name | Value | Description
NotApplicable | 0
inch | 1
ft | 2
micron | 3
mm | 4
cm | 5
m | 6
Remarks
See Also
Reference
ETABSv1 Namespace